## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.cinema must be replaced
-/+ resource "helm_release" "cinema" {
!       id                         = "cinema" -> (known after apply)
+       manifest                   = (known after apply)
!       metadata                   = [
-           {
-               app_version = "v2.1.2"
-               chart       = "cinema"
-               name        = "cinema"
-               namespace   = "kube-system"
-               revision    = 1
-               values      = "null"
-               version     = "0.2.1"
            },
        ] -> (known after apply)
        name                       = "cinema"
!       namespace                  = "kube-system" -> "cinema" # forces replacement
        # (24 unchanged attributes hidden)
    }

  # kubernetes_namespace.cinema will be created
+   resource "kubernetes_namespace" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
